import React from "react";

export default function MainContent() {
    return (
        <main className="main-container">
            {/* قسم عن المكتب */}
            <section className="about-section">
                <div className="about-text">
                    <h2>عن المكتب</h2>
                    <p>مكتب إدارة البيانات هو الجهة المعنية في أمانة منطقة المدينة المنورة بكل ما يتعلق بحوكمة البيانات وإدارتها،
                        ويُعنى بتطوير السياسات والخطط والبرامج والممارسات المرتبطة بإدارة البيانات
                        وتنفيذها، بما يضمن تعزيز جودة البيانات واستدامتها وقيمتها باعتبارها أحد الأصول الرقمية الحيوية، كما يشرف المكتب على تمكين الإدارات المختلفة
                        من استخدام البيانات بالشكل الأمثل لتحقيق الأهداف الاستراتيجية للأمانة
                    </p>
                    <h3>تأسيس مكتب البيانات</h3>

                    <p>
                        1- نصت الفقرة التاسعة من الأمر السامي الكريم رقم 59766 بتاريخ 20-11-1439هـ
                        بتأسيس مكاتب لإدارة البيانات في جميع الأجهزة الحكومية، وترتبط بالمسؤول الأول بالجهة
                        على نفس النموذج القائم لمكاتب تحقيق الرؤية.
                    </p>

                    <p>
                        2- نصت الفقرة الثالثة من الأمر السامي الكريم رقم 63451 بتاريخ 26-11-1441هـ على ما يلي:
                    </p>

                    <ul className="dot-list">
                        <li>تخصيص الجهات جزءًا من ميزانياتها لتمويل البيانات التي تؤسسها الجهات الحكومية.</li>
                        <li>يقوم مكتب إدارة البيانات الوطنية بوضع الشروط والمؤهلات اللازمة للعاملين في مكاتب البيانات.</li>
                        <li>تكون مرجعيتهم في كل ما يخص عملهم هو مكتب إدارة البيانات الوطنية.</li>
                    </ul>
                </div>

                <div className="image-boxmc">
                    <img src="/images/structure.png" alt="link" />
                </div>
            </section>

            {/* الكروت الثلاثة */}
            <section className="cards-section">
                <div className="card">
                    <div className="icon-wrapper">
                        <div className="icon-circle">
                            <img src="/images/governance.png" height="20" alt="link" />
                        </div>
                    </div>
                    <h3>إدارة وحوكمة البيانات</h3>
                    <ul>
                        <li>1 تفعيل مجالات إدارة البيانات الحركية لغرض رفع مستوى الجودة</li>
                        <li>2 تحديد أفضل الممارسات للتعامل مع البيانات</li>
                        <li>3 تفعيل العمليات الخاصة بجودة البيانات</li>
                        <li>4 رفع مستوى نضج حوكمة البيانات</li>
                    </ul>
                </div>

                <div className="card">
                    <div className="icon-wrapper">
                        <div className="icon-circle">
                            <img src="/images/benefit.png" height="20" alt="link" />
                        </div>
                    </div>
                    <h3>الاستفادة من البيانات</h3>
                    <ul>
                        <li>1 التأكد من تحقيق الإدارة وجودة وظيفية للبيانات في مختلف أنواعها</li>
                        <li>2 تمكين المستخدمين في جميع المستويات من الوصول إلى البيانات</li>
                        <li>3 خلق ابتكارات بناءً على البيانات وتوظيفها في الاستخدامات ذات القيمة العالية</li>
                    </ul>
                </div>

                <div className="card">
                    <div className="icon-wrapper">
                        <div className="icon-circle">
                            <img src="/images/share.png" height="20" alt="link" />
                        </div>
                    </div>
                    <h3>مشاركة البيانات</h3>
                    <ul>
                        <li>1 تحسين إدارة عمليات تبادل البيانات مع الجهات الداخلية والخارجية</li>
                        <li>2 المساهمة في رفع الكفاءة التشغيلية للجهات الحكومية </li>
                        <li>3 تأكيد الالتزام في القطاع الخاص بتحويل البيانات إلى معلومات قابلة للاستفادة</li>
                        <li>4 التكامل في مشاركة البيانات والملاحظات المحلية والعالمية</li>
                    </ul>
                </div>
            </section>

            {/* قسم رؤيتنا ورسالتنا */}
            <section className="vision-mission-section">
                <div className="vision-card">
                    <div className="icon-wrapper">
                        <div className="icon-circle">
                            <img src="/images/vision.png" height="20" alt="link" />
                        </div>
                    </div>
                    <h3>رؤيتنا:</h3>
                    <p>
                        أمانة تعتمد على بيانات كاملة للحصول على جودة الخدمات للمستفيدين
                        ورفع كفاءة الأعمال عبر تلبية احتياجات المستقبل واتخاذ قرارات ذكية وفعالة.
                    </p>
                </div>

                <div className="mission-card">
                    <div className="icon-wrapper">
                        <div className="icon-circle">
                            <img src="/images/mission.png" height="20" alt="link" />
                        </div>
                    </div>
                    <h3>رسالتنا:</h3>
                    <p>
                        استغلال القيمة الكاملة للبيانات من خلال اعتماد وتفعيل معايير جودة البيانات
                        وتعزيز ثقافة إدارة وحوكمة البيانات وترسيخ أهمية تطبيقها لدعم اتخاذ القرارات
                        المبنية على الأدلة والتحليلات المتقدمة.
                    </p>
                </div>
            </section>
        </main>
    );
}