export default function Platforms() {
  return (
    <section className="container py-5" dir="rtl" lang="ar">
      <h2 className="fw-bold mb-4">بنك البيانات الوطني</h2>

      <p>
        إيماناً بأن البيانات تمثل أصلاً استراتيجياً يدعم التطور الرقمي والاقتصادي والتقدم المدني والاجتماعي،
        قامت الهيئة السعودية للبيانات والذكاء الاصطناعي (سدايا) بالعمل على عدة مبادرات رئيسية تتمثل إحداها
        في بناء منظومة بيانات وطنية تُعرف باسم بنك البيانات الوطني تهدف إلى إدارة وحوكمة البيانات على المستوى
        الوطني بشمولية وفعالية عالية.
        <br />
        <br />
        بنك البيانات الوطني : هو مجموعة من منصات البيانات الوطنية المترابطة تهدف إلى تحسين جودة البيانات في
        المملكة وتعزيز مشاركتها بين الجهات والمساهمة في بناء اقتصاد رقمي قائم على البیانات
      </p>

      <hr />

      <h3 className="fw-bold mt-5">منصات بنك البيانات الوطني</h3>

      <div className="row mt-4">
        {/* بحيرة البيانات */}
        <div className="col-md-12 mb-5">
          <h5 className="fw-bold">بحيرة البيانات</h5>
          <p>
            مستودع مركزي يحتوي على كم هائل من البيانات الخام الموحدة التي جُمِعت من مختلف الجهات الحكومية على
            مستوى المملكة.
            <br />
            تشكل بحيرة البيانات الأساس الذي تقوم عليه الخدمات والمنصات الأخرى المبنية على البيانات مما يضمن
            وصولا متسقا وموثوقا للبيانات بشكل موحد ومن مصدر واحد.
            <br />
            لديها مرونة كافية لاستيعاب مجموعة ضخمة من البيانات ذات السرعات والهيكلات المختلفة.
            <br />
            تحتوي علی خدمات مساعدة لضمان إدارتها و حوکمتها وتأمینها بشکل صحیح.
          </p>

          <div className="d-flex justify-content-end">
            <a href="https://lake.data.gov.sa/ar" className="primary-color mb-2">
              الوصول للمنصة
              <img src="/images/link-icon.png" height="15" alt="link" />
            </a>
          </div>
        </div>

        {/* سوق البيانات */}
        <div className="col-md-12 mb-5">
          <h5 className="fw-bold">سوق البیانات</h5>
          <p>
            منصة تهدف إلى أتمتة كافة عمليات مشاركة البيانات بين الجهات في المملكة، فيمكن للجهات من خلال المنصة
            استعراض واجهات برمجية التطبيقات (APIs) والاشتراك فيما يناسبها منها بطريقة آلية وفقاً لسياسات حوكمة
            البيانات الوطنية.
            <br />
            ملاحظة : المنصة متاحة عبر الشبكة الحكومية الآمنة (GSN)
          </p>

          <div className="d-flex justify-content-end">
            <a href="https://api.data.gov.sa/index-ar.html" className="primary-color mb-2">
              الوصول للمنصة
              <img src="/images/link-icon.png" height="15" alt="link" />
            </a>
          </div>
        </div>

        {/* معامل تحليل البيانات */}
        <div className="col-md-12 mb-5">
          <h5 className="fw-bold">معامل تحلیل البیانات</h5>
          <p>
            معامل آمنة تُمكّن المستفيدين من موظفي الجهات الحكومية من الوصول إلى البيانات المستضافة في بحيرة
            البيانات عبر بيئة رقمية مجهزة بأحدث تقنيات تحليل البيانات والذكاء الاصطناعي لاستكشاف تلك البیانات
            وتحلیلها وإصدار التقارير المطلوبة.
          </p>

          <div className="d-flex justify-content-end">
            <a href="dmo@sdaia.gov.sa" className="primary-color mb-2">
              الوصول للمنصة
              <img src="/images/link-icon.png" height="15" alt="link" />
            </a>
          </div>
        </div>

        {/* فهرس البيانات الوطني */}
        <div className="col-md-12 mb-5">
          <h5 className="fw-bold">فہرس البيانات الوطني</h5>
          <p>
            منصة تهدف إلى توثيق كافة البيانات الوصفية الخاصة بأنظمة الجهات الحكومية وتعاريف مؤشرات الأداء
            الاستراتيجية والتشغيلية الخاصة بها، وقائمة حقول البيانات في المملكة ومصادرها الصحيحة بالإضافة إلى
            السياسات والمعايير الخاصة بالبیانات.
          </p>

          <div className="d-flex justify-content-end">
            <a href="https://2u.pw/6DTgz" className="primary-color mb-2">
              الوصول للمنصة
              <img src="/images/link-icon.png" height="15" alt="link" />
            </a>
          </div>
        </div>

        {/* منصة البيانات المرجعية */}
        <div className="col-md-12 mb-5">
          <h5 className="fw-bold">منصة البيانات المرجعية</h5>
          <p>
            منصة تهدف إلى إدارة وحوكمة البيانات المرجعية على مستوى المملكة، ووضع المعايير الفنية الخاصة بها
            وتحديد مصدر تلك البيانات لضمان اكتمال ودقة واتساق البيانات المتوفرة لدى الجهات الحكومية.
            <br />
            ملاحظة : المنصة متاحة عبر الشبكة الحكومية الآمنة (GSN).
          </p>

          <div className="d-flex justify-content-end">
            <a href="#" className="primary-color mb-2">
              الوصول للمنصة
              <img src="/images/link-icon.png" height="15" alt="link" />
            </a>
          </div>
        </div>

        {/* منصة البيانات المفتوحة */}
        <div className="col-md-12 mb-5">
          <h5 className="fw-bold">منصة البيانات المفتوحة</h5>
          <p>
            منصة تُمكّن الأفراد والجهات الحكومية وغير الحكومية من نشر البيانات المفتوحة الخاصة بها وإتاحتها
            للمستفيدين كرواد الأعمال، لتعزيز مشاركة المجتمع وتحفيز الابتكار وفق أفضل المعايير المحلية والعالمية.
          </p>

          <div className="d-flex justify-content-end">
            <a href="https://open.data.gov.sa/ar/home" className="primary-color mb-2">
              الوصول للمنصة
              <img src="/images/link-icon.png" height="15" alt="link" />
            </a>
          </div>
        </div>

        {/* منصة حوكمة البيانات */}
        <div className="col-md-12 mb-5">
          <h5 className="fw-bold">منصة حوكمة البيانات</h5>
          <p>
            منصة إلكترونية وطنية تهدف إلى حوكمة البيانات - البيانات الشخصية (كمرحلة أولى) - من خلال تقديم حزمة من
            الخدمات الإلكترونية لتقييم الالتزام واستقبال الشكاوى والاستفسارات ومعالجتها وذلك بغرض حماية البيانات
            كأصول وطنية، وحماية حقوق الافراد من التجاوزات والانتهاكات غير النظامية استناداً لنظام حماية البيانات
            الشخصية المعتمد بالمملكة.
          </p>

          <div className="d-flex justify-content-end">
            <a href="https://dgp.sdaia.gov.sa/wps/portal/pdp/home" className="primary-color mb-2">
              الوصول للمنصة
              <img src="/images/link-icon.png" height="15" alt="link" />
            </a>
          </div>
        </div>
      </div>
    </section>
  );
}
